In [ ]:
import mysql.connector 
import pandas as pd

In [ ]:
conn = mysql.connector.connect(
    host = "localhost", 
    user = "root", 
    password = "@Ngelo8998",
    database = "dw_3csc"
)

In [ ]:
c = conn.cursor()

In [ ]:
c.execute("""
    CREATE TABLE 
        students_3csc(id INT PRIMARY KEY NOT NULL, 
        firstname TEXT NOT NULL, 
        familyname TEXT NOT NULL, 
        age INT NOT NULL, 
        gwa REAL NOT NULL, 
        gender TEXT NOT NULL)
""")

In [ ]:
conn.commit()

In [ ]:
c.execute("""
    INSERT INTO 
        students_3csc
    VALUES
        (2018107987, 'John Louise', 'Lagazo', 21, 1.69, 'M')
""")

In [ ]:
conn.commit()

In [ ]:
c.execute("SELECT * FROM students_3csc")

In [ ]:
c.fetchall()

In [ ]:
test = [(2021193093, 'Louise', 'Legazpi', 19, 1.420, 'M')]

In [ ]:
test_list = list(test)

In [ ]:
c.executemany("""
    INSERT INTO 
        students_3csc
    VALUES
        (%s, %s, %s, %s, %s, %s)
""", test_list)

In [ ]:
conn.commit()

In [ ]:
id = input("id: ")
firstname = input("firstname: ")
familyname = input("familyname: ")
age = input("age: ")
gwa = input("gwa: ")
gender = input("gender: ")

In [ ]:
c.execute("""
    INSERT INTO 
        students_3csc
    VALUES
        (%s, %s, %s, %s, %s, %s)
""", (id, firstname, familyname, age, gwa, gender))

In [ ]:
conn.commit()

In [ ]:
df1 = pd.read_sql_query("SELECT * FROM students_3csc", conn)
df1

In [ ]:
import csv
import csv as reader

In [ ]:
# using csv reader
csc_g1 = open("3csc - csc_g1.csv")
g1_3csc = csv.reader(csc_g1)
g1_3csc

In [ ]:
# creating a list
g1 = list(csv.reader(csc_g1))
g1

In [ ]:
c.executemany("""
    INSERT INTO students_3csc VALUES(%s, %s, %s, %s, %s, %s)
""", g1)

In [ ]:
conn.commit()

In [ ]:
df_g1 = pd.read_sql_query("SELECT * FROM students_3csc", conn)
df_g1

In [ ]:
csc_g2 = open("3csc - csc_g2.csv")
g2_3csc = csv.reader(csc_g2)
g2_3csc

In [ ]:
# creating a list
g2 = list(g2_3csc)
g2

In [ ]:
c.executemany("""
    INSERT INTO students_3csc VALUES(%s, %s, %s, %s, %s, %s)
""", g2)

In [ ]:
df_g1_and_g2 = pd.read_sql_query("SELECT * FROM students_3csc", conn)
df_g1_and_g2

In [ ]:
c.execute("""
    CREATE TABLE info2(
        applicant_no INT NOT NULL PRIMARY KEY,
        ustet_score REAL NOT NULL,
        jhs_gwa REAL NOT NULL,
        shs_gwa REAL NOT NULL, 
        strand TEXT NOT NULL
    )
""")

In [ ]:
conn.commit()

In [ ]:
# using csv reader
csc_info = open("3csc - csc_info2.csv")
info_3csc = csv.reader(csc_info)
info_3csc

In [ ]:
# creating a list
info = list(info_3csc)
info

In [ ]:
c.executemany("""
    INSERT INTO info2 VALUES(%s, %s, %s, %s, %s)
""", info)

In [ ]:
complete_info2 = pd.read_sql_query("SELECT * FROM info2", conn)
complete_info2

In [ ]:
conn.commit()

In [ ]:
query = """
    SELECT 
        *
    FROM 
        students_3csc 
    INNER JOIN
        info2
    ON
        id = applicant_no
"""
inner_join = pd.read_sql_query(query, conn)
inner_join

In [ ]:
query = """
    SELECT 
        *
    FROM 
        students_3csc 
    LEFT JOIN
        info2
    ON
        id = applicant_no
"""
left_join = pd.read_sql_query(query, conn)
left_join

In [ ]:
# using of pandas and engine to insert csv into the database
from sqlalchemy import create_engine

In [ ]:
engine = create_engine('mysql+mysqlconnector://root:@Ngelo8998@localhost:3306/dw_3csc')

In [ ]:
csv = pd.read_csv("3csc - csc_info2.csv")

In [ ]:
csv.to_sql("info2", engine, index = False, if_exists = "replace")

In [ ]:
query = """
    SELECT 
        id,
        gwa
    FROM 
        students_3csc 
    UNION
    SELECT 
        applicant_no,
        ustet_score
    FROM 
        info2
"""
union = pd.read_sql_query(query, conn)
union

In [ ]:
query = """
    SELECT 
        id,
        gwa
    FROM 
        students_3csc 
    UNION ALL
    SELECT 
        applicant_no,
        ustet_score
    FROM 
        info2
"""
union_all = pd.read_sql_query(query, conn)
union_all

In [ ]:
# Rollup
query = ('''
    SELECT 
    gender, gwa, age, AVG(gwa)
    FROM students_3csc
    GROUP BY gender, gwa, age WITH ROLLUP
''')
pd.read_sql(query, conn)